from flask import Blueprint, render_template
from flask_babel import  gettext as _
import os, json
Groups_Mand = Blueprint(__name__, "Groups_Mand", static_folder="static", template_folder="templates")
BASE_DIR = os.path.dirname(os.path.abspath(__file__))
path = os.path.join(BASE_DIR,"templates", "groups.json")
with open(path, "r", encoding="UTF-8") as file:
    content = json.load(file)




def names_codes ():
    return {
    'TRA101': _('قواعد اللغة الانجليزية (1)'),
    'TRA102': _('قواعد اللغة الانجليزية (2)'),
    'TRA104': _('كتابة الفقرة في اللغة الإنجليزية'),
    'TRA105': _('صوتيات اللغة الإنجليزية'),
    'TRA202': _('النحو التطبيقي المقارن (1)'),
    'TRA208': _('قراءة متقدمة باللغة الإنجليزية'),
    "TRA210": _("مدخل الى الأدب الإنجليزي والعربي"),
    'TRA230': _('ترجمة عامة(E-ع)'),
    'TRA232': _('ترجمة عامة (ع-E)'),
    'TRA241': _('مقدمة في نظريات الترجمة'),
    'TRA320': _('قواعد متقدمة باللغة الانجليزية'),
    'TRA206': _('كتابة المقال في اللغة الانجليزية'),
    'TRA311': _('الترجمة الأدبية'),
    'TRA312': _('الترجمة السمعبصرية'),
    'TRA321': _('علم المعاني والبراجماتية'),      
    'TRA330': _('الترجمة التتابعة والفورية (E-ع)'),
    "TRA331": _("الترجمة التتابعة والفورية (ع-E)"),
    'TRA332': _('الترجمة بإستخدام الحاسوب'),
    'TRA333': _('الترجمة القانونية'),
    'TRA334': _('الترجمة الاعلامية'),
    'TRA335': _('الترجمة التقنية'),
    'TRA430': _('تحليل الخطاب'),
    'TRA431': _('النحو العربي لأغراض الترجمة'),
    'TRA433': _('الترجمة والسياحة'),
    'TRA412': _('ترجمة القصة القصيرة'),
    'TRA340': _('المعاجم والمصطلحات'),
    'TRA433A': _('الترجمة والسياحة'),
    'TRA439': _('مشروع التخرج'),
    "TRA438": _("ترجمة نصوص دينية"),
    "TRA435": _("موضوع خاص في الترجمة"),
}
@Groups_Mand.route("/مجموعات-طلابية-قسم-الترجمة-المساقات-الاجبارية")
def groups_mand():
    return render_template("view.html",
    title=_("مجموعات لمساقات القسم الاجبارية"),
    description = _("موقع تعليمي لطلاب قسم الترجمة في جامعة اليرموك: انضم إلى مجموعات واتساب مخصصة لطلاب قسم الترجمة في جامعة اليرموك لمواد القسم الاجبارية تواصل مع زملائك، شارك الموارد، وناقش مواضيع تعليمية لتعزيز دراستك."),
    choices= names_codes(),
    dic = content['mandatory'],
    is_groups=True)

@Groups_Mand.route("/مجموعات-طلابية-قسم-الترجمة-المساقات-الاختيارية")
def groups_elect():
    return render_template("view.html",
    title=_("مجموعات  لمساقات القسم الاختيارية"),
    description = _("موقع تعليمي لطلاب قسم الترجمة في جامعة اليرموك: انضم إلى مجموعات واتساب مخصصة لطلاب قسم الترجمة في جامعة اليرموك لمواد القسم الاختيارية تواصل مع زملائك، شارك الموارد، وناقش مواضيع تعليمية لتعزيز دراستك."),
    choices= names_codes(),
    dic = content['electives'],
    is_groups=True)
