from flask import render_template, Blueprint
from flask_babel import Babel, gettext as _

Studyplan = Blueprint(__name__,"Studyplan", static_folder="static", template_folder="templates")

@Studyplan.route("/الخطة-الشجرية-2022-فما-قبل-قسم-الترجمة-جامعة-اليرموك-قسم-اجباري/الخطة-الدراسية-لقسم-الترجمة-جامعة-اليرموك")
def old_mand():
    return render_template("viewPlan.html", title= _("الخطة الشجرية 2022 فما قبل قسم اجباري"),description =_("الخطة الشجرية لقسم الترجمة 2022 فما قبل لمواد القسم الاجبارية. جامعة اليرموك"),file="الخطة-الشجرية-قسم-الترجمة-جامعة-اليرموك-المواد-الاجبارية-2022-وما-قبل",credits=_('احمد حجازي'))
    

@Studyplan.route("/الخطة-الشجرية-2022-فما-قبل-قسم-الترجمة-جامعة-اليرموك-قسم-اخنياري/الخطة-الدراسية-لقسم-الترجمة-جامعة-اليرموك")
def old_elect():
    return render_template("viewPlan.html", title=_( "الخطة الشجرية 2022 فما قبل قسم اختياري"),description =_("الخطة الشجرية لقسم الترجمة 2022 فما قبل لمواد القسم الاختيارية. جامعة اليرموك"),file="الخطة-الشجرية-قسم-الترجمة-جامعة-اليرموك-المواد-الاختيارية-2022-وما-قبل",
    credits=_('احمد حجازي'))
        


@Studyplan.route("/الخطة-الشجرية-2023-فما-بعد-قسم-الترجمة-جامعة-اليرموك-قسم-اجباري/الخطة-الدراسية-لقسم-الترجمة-جامعة-اليرموك")
def new_mand():
    return render_template("viewPlan.html", title= _("الخطة الشجرية 2023 فما بعد قسم اجباري"),description =_("الخطة الشجريةلقسم الترجمة 2023 فما بعد لمواد القسم الاجبارية. جامعة اليرموك"),file ="الخطة-الشجرية-قسم-الترجمة-جامعة-اليرموك-2023-فما-بعد-قسم-اجباري",
                          credits=_('احمد حجازي') )
    

@Studyplan.route("/الخطة-الشجرية-2023-فما-بعد-قسم-الترجمة-جامعة-اليرموك-قسم-اخنياري/الخطة-الدراسية-لقسم-الترجمة-جامعة-اليرموك")
def new_elect():
    return render_template("viewPlan.html", title= _("الخطة الشجرية 2023 فما بعد قسم اختياري"),description =_("الخطة الشجريةلقسم الترجمة 2023 فما بعد لمواد القسم الاختيارية. جامعة اليرموك"),file="الخطة-الشجرية-قسم-الترجمة-جامعة-اليرموك-2023-فما-بعد-قسم-اختياري"
                           ,credits=_('احمد حجازي'))
